

 {
    "title": "Covalent API's Integration of Evmos and the #OneMillionWallets Hackathon",
    "description": "## Summary\n\nThis proposal is the second iteration of the original proposal posted on Commonwealth on the 19th of July.  We are seeking community funding for our previous work as well as future efforts in indexing the Evmos network for the Covalent Unified API, along with the launch of the Evmos-Covalent Joint *#OneMillionWallets* Hackathon\n\n - **Covalent will continue to index the Evmos network and receive a compensation of 100K USD, which will be staked entirely and delegated to lower validators.**\n - **Covalent will run a joint hackathon with Evmos to onboard more developers, and explore and kickstart novel use cases for the Evmos ecosystem with a prize pool of $100K.**\n - **The total ask is $200K in Evmos tokens - The amount of tokens for the hackathon prizes of $100k will be determined at time of dispersement. In the case of extreme price volatility, the Governance workstream will assist in readjusting the community pool funding request.** \n\n\nNote: Because of the character limit of Cosmos SDK's governance module, some portions of the proposal have been left out and the proposal has been modified for on-chain submission with the help of the Evmos DAO Governance Workstream. View the full proposal on [Commonwealth](https://commonwealth.im/evmos/discussion/6603-prevote-covalent-apis-integration-of-evmos-and-joint-hackathon). \n\n## Background\n\nAt Covalent, we believe blockchain technologies can change the world, but this potential is left unfulfilled if the data is not accessible. Despite the proliferation of on-chain digital assets, current solutions require developers to spend hours writing additional code to query granular blockchain data.\n\nCovalent is the only multi-chain API that provides every single point of on-chain data - directly from the browser. With no extra code, you need just one API call to query any piece of data across +40 blockchains.\n\n - +40 blockchains indexed, including  Arbitrum, Aurora, Avalanche, BNB, Ethereum, Evmos, Fantom, Harmony, Ronin, Moonbeam & Polygon\n - +30K developers, and\n - +3K live projects, including 0x, Aave, CoinGecko, ConsenSys, DappRadar, NFTX, ParaSwap, Sovryn, Uniswap, XDEFI Wallet & Zerion\n - +2.5M calls made to Evmos using Covalent's Unified API\n\n**Evmos API Call Volume Growth (Month over Month)**\n\n- June 2022 -- 2M / +312%\n - May 2022 -- 500K / +170,489%\n - April 2022 -- 282 / +14,000%\n - March 2022 -- 2\n\nCovalent's vision is to empower the pioneers of tomorrow by providing the most robust data infrastructure for the entire blockchain ecosystem, delivering complete transparency and visibility to all on-chain digital assets.\n\n## API Endpoints for Evmos\n\n- Class A endpoints - These return enriched blockchain data applicable to all blockchain networks\n - Class B endpoints - These are for a specific protocol on a blockchain\n - Class C endpoints - This will be a community-driven market where users can create API endpoints for their projects\n - DEX & NFT marketplace data (i.e., EvmoSwap, Diffusion) & more to be integrated as the number of protocols grow. \n - Covalent will be indexing the entirety of Evmos' on-chain data\n\nMore details about our API can be found in [Evmos | Covalent Docs](https://www.covalenthq.com/docs/networks/evmos/) \n\n## Timeline\n\n**The indexing of Evmos has already been completed and the completion was publicly announced on 30 May 2022. The indexing of Evmos is currently live, and freely available for developers.**\n\n- 30 May - 15 August 2022 -- A proposal to index Evmos is floated in the Evmos governance forum.\n - 22 September 2022 -- The joint hackathon registration goes live.\n - 22 October 2022 -- The Joint '#OneMillionWallets' Hackathon begins.\n\n## Deliverables\n\nPre-integration and Post-integration deliverables can be viewed in the [full proposal here](https://commonwealth.im/evmos/discussion/6603-prevote-covalent-apis-integration-of-evmos-and-joint-hackathon). \n\n## Funding & Disbursement\n\nThe EVMOS/USD exchange rate for the disbursements is to be determined according to the exchange rate at which the disbursements are made. \n\n- API and Indexing: 100K USD of Evmos  tokens will be released upon the passing of the proposal. **Covalent will stake the compensation and delegate it to lower validators** for up to one year. \n - #OneMillionWallets Hackathon: Roughly $100K in Evmos will be used to host the joint hackathon. \n\n The funds will be released initially to a 3 of 4-person multisig wallet with the following signatories: \n - Leibing, Dev Relations @ Covalent \n - Daniel, Data Journalist @ Covalent \n - LPX, Evmos DAO Governance \n - Benny Lava, Evmos DAO & Community Mod\n\n**Multisig deployment address:** 0x05a6991caD6B2258Bc5c7FE2b0793Af93590DbD0\n\nCovalent has an impressive track record of successful hackathons for Layer-1 networks. Past outcomes, marketing plans, and Evmos bounty tracks can be read in detail in the [full proposal](https://commonwealth.im/evmos/discussion/6603-prevote-covalent-apis-integration-of-evmos-and-joint-hackathon).",
    "recipient": "evmos1qknfj89ddv3930zu0l3tq7f6ly6epk7s7kf53v",
    "amount": "80400000000000000000000aevmos",
    "deposit":"10000000000000000aevmos"
 }