{
    "title": "[ECP-2A] Formalizing and Funding the Governance Council Workstream (Rev. 2)",
    "description": "# ECP-2A: Formalizing and Funding the Governance Workstream (Rev. 2)\n\n## Authors \n- LPX | Evmos DAO\n- GV | Evmos DAO \n- Benny Lava | Evmos DAO\n\nOperating under the community-ratified Interim Constituion of Evmos DAO ([Proposal #51](https://www.mintscan.io/evmos/proposals/51)), the Governance Workstream has been serving the Evmos DAO and Community without funding for the past eight months. We are officially requesting formalization by funding.\n\nThis proposal applies all rules defined and approved by the community in ECP-1 ([Proposal #83](https://www.mintscan.io/evmos/proposals/83)). An [FAQ page](https://github.com/EvmosGov/proposals/blob/main/ECP/2A/faq.md) has been created and will kept up to date with important questions asked by the Community.\n\n## Preface \n\nFollowing the rejection of Proposal 86, we have conducted a thorough review of the initial proposal and the valuable feedback provided by the Evmos community and validators. This revised proposal was created with objectives to address issues and concerns raised by the community while remaining aligned with the Governance Workstream's Mission, Vision, and Values. We are confident that this revised proposal achieves this goal.\n\nAddressed issues from Proposal 86:\n\n- The total token request has been significantly [reduced by 80% in this proposal](https://github.com/EvmosGov/proposals/blob/main/ECP/2A/revision.md).\n- R&D, Ecosystem Bootstrap, and Treasury Diversification funds have been excluded in order to facilitate a more targeted dialogue with the community regarding these initiatives and potential funding.\n- The retroactive payment request has been decreased by 64% ($750/mo per contributor).\n- Additional cost-saving measures include the elimination of 2 future workstream contributors and the request for only the first year of vesting emissions for existing members.\n\n## Abstract\n\n### The Governance Workstream's Mandate\n\nThe Governance Council exists and operates as a neutral party with allegiances only to the Evmos network and the guiding values of the Evmos Constitution. While the workstream is tasked with various duties, our mandate is simple: to facilitate and protect the integrity of Evmos' governance processes and, to the best of our ability, create a fair and transparent environment in which the network and the community can prosper and thrive.\n\n- Duties, Responsibilities, Deliverables of the Governance Workstream: [Detailed Page](https://github.com/EvmosGov/proposals/blob/main/ECP/2A/duties.md)\n\n### Contributions to Evmos\n\nThe Governance Workstream's wide array of contributions and community service for the past half-year range from simple proposal guidance for projects to both native and external liquidity programs responsible for the movement of tens of millions of dollars. \n\n- List of Achievements and Progress Report: [Detailed Page](https://github.com/EvmosGov/proposals/blob/main/ECP/2A/report.md)\n\n### Progressive Decentralization \n\nWe also want to emphasize that we are not trying to hold on to power or exert control over the ecosystem. We expect to be scrutinized every funding cycle, and replaced if needed. Our goal is to accelerate the development of the decentralized ecosystem, and to create a future in which power is distributed back to the Evmos Community.\n\nWhile we have ambitious plans to create an ecosystem of community owned liquidity and a democratized spending of liquid funds, we have removed all funding requests related to these initiatives for various reasons - separate proposals will be made for these initiatives when we are better prepared to present them.\n\n## Funding Request\n\nThis 6-month funding proposal has been pegged to the price of $0.40 / EVMOS. The total funding amount was reduced by ~80% to the previous proposal and represents now 0.81% of the community pool. The dollar amount requested at current price was also reduced from $2.37mil to $380K. For a breakdown of the ask reduction, please [refer to this page](https://github.com/EvmosGov/proposals/blob/main/ECP/2A/revision.md).\n\n**Contributor Compensations**\n\nThe funding ask includes the base, retro, and vesting pay for 3 existing Governance workstream members as well as the onboarding of three more members, for a total of 6 Governance workstream members.\n- A detailed outline of contributor compensation: [Detailed Page](https://github.com/EvmosGov/proposals/blob/main/ECP/2A/contributors.md)\n\n**Total:** 950,000 EVMOS\n\n### Fund Disbursements\n\nThis funding proposal will kick off the \"DAO Treasury\" which is managed by 3 Governance members and 5 Validators in a `5-8` Gnosis Safe configuration. All treasury spending will be publicly viewable with full transparency. Spending, compensations, swaps, and all expense reports will be rigorously kept up to date. \n\n**Treasury Signatories**:\n\n- Tam | TC Network\n- CO | Orbital Apes\n- Long | Notional\n- OutCast | Legion Nodes\n- Yubin Park | a41\n- Benny | Governance\n- LPX | Governance\n- GV | Governance\n\n**Safe Deployment Address**: [0xC3C5156911bf53f12913b68E0532096536B30600](https://safe.evmos.org/evmos:0xC3C5156911bf53f12913b68E0532096536B30600) (evmos1c0z326g3haflz2gnk68q2vsfv5mtxpsqgqgd0v)",
    "recipient": "evmos1c0z326g3haflz2gnk68q2vsfv5mtxpsqgqgd0v",
    "amount": "950000000000000000000000aevmos",
    "deposit": "100000000000000000aevmos"
}