{
    "type":"Text",
    "title":"[ECP-1] Formalizing the Foundational Layer of Evmos DAO Governance",
    "description":"**Author:** LPX, Evmos DAO Governance Council\n\n**Notice:** This proposal submission has been significantly shortened to fit within the proposal word count and accompanying graphical content has been removed - we highly recommend reading the full version on [GitHub](https://github.com/EvmosGov/proposals/blob/main/ECP/ECP-1.md).\n\n**Abstract:** This proposal set is the continuation of the work which we committed to in the Evmos Interim Constitution, and draws inspiration from our ratified Guiding Values. Each proposal was carefully designed as they will each have long-term ripple effects on the DAO and Community as a whole. After a month of deliberation and productive discussions on Commonwealth, we feel confident to move forward.\n\nThe scope of this vote is to formalize ECP-1, which includes two submodules:\n- ECP-1A: Formalizing the Evmos Community Proposal Framework\n- ECP-1B: Formalizing the Workstream (sub-DAO) and Compensation Framework\n---\nThe rest of the following proposals will be presented to the community very shortly:\n\n- ECP-2A: Formalizing and Funding the Evmos DAO Governance Council\n- ECP-2B: Formalizing and Funding of the Community Mod & Support Workstream\n- ECP-3: Empowering the Community with Strategic Growth Initiatives*\n- ECP-4: The Establishment of the Evmos DAO Grants Program*\n---\n**ECP-2A will be submitted for voting later tonight, with ECP-2B to follow within the week.**\n**ECP-3 and ECP-4 will be finalized and proposed in Q1 2023, but the proposal drafts are available for preview on [Commonwealth](https://commonwealth.im/evmos/discussions/2.%20Evmos%20DAO%20Proposals) as well as [GitHub](https://github.com/EvmosGov/proposals/blob/main/ECP/ECP-3.md).**\n\n**Motivation:** The Evmos ecosystem — to be blunt — is in need of much more than liquidity incentives. While our strong governance processes and collaborative community culture have propelled us to the top of the Cosmos ecosystem in terms of governance participation, there are countless roles to be filled, infrastructure and public goods to build and fund, projects and initiatives in need of manpower, and the growing list of tasks at hand for the Evmos core team is becoming harder to manage.\n\nThe urgency to get our community more involved in the efforts of growing the Evmos ecosystem is increasing by the day, and systems must be put in place in which allows for the more efficient use of our resources. The power of networks and DAOs lies in the strength of the community — while all DAOs are different, this is a single common denominator that has held true for years.\n## ECP-1A: Evmos Community Proposal Framework\n**Summary**: This proposal seeks to formalize the adoption of the Evmos Community Proposal (ECP) framework. All community proposals must go through the proposal lifecycle as outlined in the framework before going on-chain for voting.\n\n**Abstract:** ECPs are standardized proposals subject to voting that (once enacted) regulate and define the behavior of the Evmos DAOs Governance system, and provides a funding mechanism for special projects and workstreams. The Evmos Community Proposal (ECP) Framework sets the guideline for all subsequent ECPs to follow. This ECP is the foundational ECP that provides the necessary templates, processes, and guidelines for working within the framework and defines the key roles required for the operation and enforcement of the ECP process.\n## ECP Framework Components\n### 1. Definitions of the ECP Framework\n### 2. The ECP Lifecycle \n**Phase 1: Discussion & Ideation | Min. 48 hours | Forum Tag: [IDEATION]**\n**Phase 2: ECP Formalization | Min. 72 hours | Forum Tag: [PRE-PROPOSAL]**\n**Phase 3: ECP Signaling (Temp. Check) | Min. 72 hours | Forum Tag: [PROPOSAL]**\n**Phase 4: On-Chain Voting | Forum Tag: [VOTING]**\n### 3. ECP Standards and Templates\n### 4. ECP Submission Guidelines\nPlease refer to [Full Proposal >](https://github.com/EvmosGov/proposals/blob/main/ECP/ECP-1.md)\n---\n## ECP-1B: Formalizing the Workstream (subDAO) and Compensation Framework \n\n**Summary:** Workstreams, also known as subDAOs, guilds, committees, etc., are long-term projects with distinct, high-level objectives that are aligned with the main DAO. Coordination at scale requires a distributed organization — and distributed organizations require a certain level of coordination and set expectations to work together effectively.\n\n**Abstract:** Workstreams and subDAOs are key in scaling a DAO and are crucial in grassroots community growth. The Workstream Framework introduces a fractalized blueprint of subDAOs and teams, the incentive alignment mechanics, funding and formation processes, and expectations. One of the core guiding values in our Constitution is the *Sovereignty to Work*. Every team, workstream, subDAO — whatever title they wish to be called by — will be unique in how they operate. Please refer to full proposal for our vision for workstreams.\n### 1. Definition and Purpose \nWorkstreams are typically DAO-funded teams with a recurring budget with no termination date (i.e., Community Moderation & Support, Marketing & Creative Services, etc). A workstream is a group of people actively working on tasks that align with Evmos [Constitutional Values](https://gov.evmos.community/constitution#3-guiding-principles-and-values) and community run initiatives.\n### 2. Workstream Requirements \nAnyone may start a workstream and gather momentum behind it by posting on Commonwealth. Until a formal proposal for a budget is made, this workstream is considered informal. A workstream can be as broad or narrow as its initiators like, but workstream proposals must satisfy the various creation.\n### 3. Workstream Formation Process\n### 4. Workstream Stages\n\n## The Standardized Compensation Framework\nOur goal is to scale the Evmos DAO by attracting and retaining great contributors and leaders.\n**Compensation Principles, Compensation Types, Compensation Eligibility** can be found in the full document.\n\nWhen a workstream makes a formal funding request the list of team member roles must include:\n- The role the contributor plays\n- The weekly time commitment \n- The monthly compensation amount \n- Compensation rationale (base and vested) \n\nCommunity ownership of a project rests on transparency, and transparency rests on legitimacy. Salary will be transparent to all DAO contributors, through a standardized base compensation framework for all current and future workstream members. This framework also aims to increase equity between workstreams as well as between network stakeholders & the DAO. \n\n## Base Compensation\n**Base Compensation Parameters**\n\n**1 | Value Level** - refers to the contributors expected value created during the compensation cycle on a scale of 1 to 3. While measuring the value of a contributor is challenging and subjective, the following matrix will hopefully assist in the assignment of each contributors level. Value Level Assessment Matrix - Please refer to the full proposal.\n\n**2 | Commitment Level** - The DAO will cap time full-time commitments to 40 hour work weeks for a total of 160 hours / month. Extra commitments are not officially recognized by the base compensation framework - this responsibility will be given to the Evmos Community and workstream leaders.\n\nCommitment Levels are expressed as percentages, with 100% representing A) a full-time commitment and B) the sole prioritization and focus on the duties assigned by the respective workstreams of Evmos DAO. Part B of the Commitment Level is self-assessed, and each contributor shall publicly declare their prioritization levels (i.e. secondary job commitments, contributing to multiple workstreams, contributing to other DAOs or chains, etc.)\n\nExample scenarios: refer to the full proposal.\n\n**3 | Base Rate** - The base rate is currently proposed at $28/hr. The Community may vote to adjust the hourly rate through a governance proposal to account for changes in market conditions and/or treasury reserve levels. \n\n**Calculating Base Compensation**:\n `Monthly Compensation = ($28/hr base * Value Level) * (160 hours * Commitment Level)`\n## Vesting Compensation\n**Vesting Compensation Parameters**\n\n**1 | Contribution Level** - Every workstream and subDAO should be working on a 6-month funding cycle. Workstream leaders are required to provide the Community a progress report every cycle and is responsible for keeping all contributors accountable in their work and their commitment. The Evmos Community, including the Governance Council, is expected to keep workstream leaders accountable in management of their teams (including off-chain governance proposals for removal and replacement of contributors).\n\nThe Contribution Level will be a point-based system in which all workstream members must earn; thus the beginning points for all members should start at 0. For each funding cycle that passes, the Contribution Levels should rise in proportion to the Commitment Level from Base Compensations for all contributors that are still contributing as active members.\n\nRefer to full prop for more details.\n\n**2 | Accountability Level** - With greater responsibilities comes even greater accountability. Accountability is calculated on a scale from 1 to 2. \n\nPlease refer to the full proposal to view the accountability level table.\n\n**Calculating Vesting Compensation**:\n`Vesting = Yearly Base Compensation * Contribution Level * Accountability Level`\n\nVesting schedules for all contracts are 4-years.\n\n[Full Proposal >](https://github.com/EvmosGov/proposals/blob/main/ECP/ECP-1.md)",
    "deposit":"10000000000000000000aevmos"
 }