{
    "title": "Actionable analytics, management, and Incentives tools for liquidity providers by Revert Finance",
    "description": "# Actionable analytics, management, and Incentives tools for liquidity providers by Revert Finance\n\n## Authors\n\n- Evmos DAO ([Telegram](https://t.me/evmosdao),  [Twitter](https://twitter.com/EvmosDAO))\n- Forge ([Telegram](http://t.me/forgedex),  [Twitter](https://twitter.com/forgedex))\n- Mario | Revert Finance  ([Website](https://revert.finance/)[Twitter](https://twitter.com/revertfinance))\n\n## Summary\n\nThe Forge team recognizes the valuable tools and resources for v3 that Revert Finance would bring to the Evmos ecosystem and have been in talks for deployment. This proposal aims to formalize the partnership and commitment to deploy, which will also allow the start of the incentives programs on Forge through their unique time-vested [incentives contracts](https://mirror.xyz/revertfinance.eth/pUufXuRkUHjrV_oq0bq2sunvQ0hz7u529jWDKlQnm-Q).\n\n## Introduction to Revert Finance\n\nRevert Finance is a well-known protocol in the DeFi landscape for their unparalleled tools, data and analytics, and resources to optimize Univ3 liquidity positions, empowering users to make the most of their liquidity. Valuable analytics such as a position’s PNL, ROI, impermanent loss, historical data, amount invested, etc., provides great insights that are easily understood by users.\n\nRevert has a solid track record, with successful collaborations with Uniswap deployments on other networks, such as [Polygon](https://mirror.xyz/revertfinance.eth/_FfxBuW7iNwyJZuM796J3rHzRQ4wOYdAck3nWqqcoIE) and [Optimism](https:/mirror.xyz/revertfinance.eth/9GC9GWqygz-naejNxHueFZSH3RXCltqZ9BT_4LsWsWg). \n\nWe encourage everyone to watch [this video](https://www.youtube.com/watch?v=O61msPF5MYw) to learn more and get detailed insights on Revert’s tools. \n\n## Tools\n\n**Position Analytics:** Check and easily track the performance of your positions on Forge. Info and screenshot [here](https://docs.revert.finance/revert/position-analytics/uniswap-v3-positions).\n\n**Top positions:** The Top Positions section shows a list of the top active positions based on how they are performing overall on Evmos. Info and screenshot [here](https://docs.revert.finance/revert/top-positions).\n\n**Incentives:** Revert has an incentives section that displays the currently running incentives programs on the Uniswap v3 canonical staker contract, as well as the time-vested staker contract. Uniswap v3 position dashboards automatically detect and display the rewards accrued by each position. Info and screenshot [here](https://docs.revert.finance/revert/liquidity-incentives/time-vested-v3-staker).\n\n**Initiator:** The initiator helps users *initiate* LP positions. Opening positions on concentrated liquidity AMMs requires making important decisions about price ranges, which can be greatly aided with historical data and analysis. Info and screenshot [here](https://docs.revert.finance/revert/initiator/start-providing-liquidity).\n\n**Auto-compounding:** The Revert auto-compounder allows LPs to automate the compounding of the accrued fees in exchange for a fixed percentage of the compounded fees. This serves to incentivize a maximum number of compounds at optimal times with regards to gas costs. Info and screenshot [here](https://docs.revert.finance/revert/auto-compounder).\n\n**Position Management:** The position management interface is available from the account and position pages, where LPs can Add or Withdraw Liquidity and Claim Fees. Within this interface, you can also swap tokens to align with your desired ratio when adding liquidity, withdrawing, or claiming!\n\n## Milestones and Deliverables\n\nDeliverables refer to the tangible or intangible items that are completed by Revert Finance. These deliverables are grouped together into milestones. The team at Revert Finance has set a target of completing all the deliverables within ~8 weeks, with the goal of demonstrating a long-term commitment to the project. Milestone 1 is prioritized by Revert to help with the roll out of Forge incentives. The project start date is May 1st. \n\n**Milestone 1 - Incentive Tools [25% release 1 months after completion]**\n\n- Vested v3staker contract: Deployment of the vested v3 staker contract on EVMOS\n- Vested v3staker frontend: allowing anyone to stake positions and the creation of incentive programs for Forge pools.\n\n**Milestone 2 - Analytics and Indexing** **[25% release 2 months after completion]**\n\n- Analytics for existing positions: LPs are able to track PNL, APR, Fees etc for their positions\n- Indexing of top positions: Users are able to browse and explore the catalog of existing positions across Forge pools\n\n**Milestone 3- Position Management and Auto-compounder [25% release 3 months after completion]**\n\n- Initiator / backtester for Forge pools: Users are able to backtest and create new positions using the revert interface\n- v3utils contract and frontend: Utilities for LPs, swap and mint, move ranges, etc..\n- Auto-compounder: Deployment and support for the auto-compounder contract and protocol including auto-compounding bots\n\n**Milestone 4 - Keplr integration [25% release 4 months after completion]**\n\n- Integration of Keplr wallet\n\n## Revenue Module\n\nThe contracts that are deployed in Milestone 1 (vested v3staker contracts, i.e. pool incentives) will be registered on the [x/revenue module](https://docs.evmos.org/protocol/modules/revenue) with the Forge Community Multisig Safe as the `WithdrawerAddress`.\n\nThis will demonstrate Revert’s commitment and alignment with Forge’s core concept of being community owned, assist in the long-term goal of becoming a self-sustainable public good of Evmos, and shows good faith in Revert’s desire to grow alongside with the Evmos Community.\n\n## Funding Amount\n\nThe requested amount of 200,000 Evmos goes fully to the Revert Finance team if the milestones and deliverables are met. If the Revert Finance team fails to deliver within 4 months after the proposal passed, the remaining funds will be returned. \n\nSignatories (3/5 Threshold):\n\n- DAO | Benny\n- OA | CtrlAltApe\n- Rok | Qubelabs\n- Mario | Revert Finance\n- Bosco | Silk Nodes\n\nSafe Deployment Address: [0x3d7E191cABba892CEa2E00D06C67aF08dfd58CdD](https://safe.evmos.org/home?safe=evmos:0x3d7E191cABba892CEa2E00D06C67aF08dfd58CdD&showCreationModal=true)",
    "recipient": "evmos184lpj89th2yje63wqrgxcea0pr0atrxavjt08z",
    "amount": "200000000000000000000000aevmos",
    "deposit": "100000000000000000aevmos"
}