{
    "title": "Treasury stEVMOS/EVMOS Liquidity Pool on Forge",
    "description": "## Author\n\n- Evmos DAO [Telegram](t.me/evmosdao), [Twitter](https://twitter.com/EvmosDAO)\n- Forge [Telegram](t.me/forgedex), [Twitter](https://twitter.com/forgedex)\n\n## Summary\n\nThis proposal aims to provide liquidity of the Evmos treasury to the stEVMOS/EVMOS pair. We request 2M Evmos, with 1M Evmos allocated for liquid staking. All funds (~1M stEVMOS and 1M EVMOS) will be added to the Forge stEVMOS/EVMOS liquidity pool (~600k USD). It will be actively managed by the DAO, OA + two trusted and active community members. \n\n## Abstract\n\nThis initiative is designed to enhance the growth and long-term sustainability of the ecosystem. \n\nIt involves requesting 2M Evmos from the Evmos treasury and staking 1M Evmos in the liquid staking module of Stride. The DAO will then allocate 1M stEVMOS and 1M EVMOS to the Forge liquidity pool. This will improve the liquid staked token liquidity of Evmos in the market, and the allocation will be monitored and adjusted based on market conditions and community input.\n\nRewards Distribution and DAO Sustainability is another key initiative. The rewards generated from liquid staking and the Forge liquidity pool (LP fees) will be directed to the multisig wallet. A portion of the rewards will be used to cover the operational costs of the DEX to ensure long-term sustainability and growth. This includes development, maintenance, moderation, promotion, marketing, legal and compliance duties. As of today we have monthly costs of roughly ~1k USD (graph service, quote api). The remaining rewards will be allocated for Forge bounties. Bounties are a common way for decentralized exchanges to incentivize developers and security researchers to contribute to the platform. Here are some potential bounties: \n\n- Feature bounties: A feature bounty program incentivizes developers to contribute new features or improvements to the platform's codebase.\n- Education bounties: An education bounty program incentivizes users to create educational content about the platform, such as blog posts, videos, or tutorials.\n- Bug bounties: A bug bounty program rewards security researchers for identifying and reporting security vulnerabilities or bugs in the platform's codebase.\n\nWe value transparency and accountability in all aspects of our operations, including our bounty programs. As part of our commitment to transparency, we will provide quarterly reports detailing the bounties we have offered and the costs associated with Forge.\n\nTo ensure the security and integrity of staked funds and community assets, Univ3 liquidity pools will be utilized, which have a proven track record of security and reliability on Ethereum. Acknowledging the potential risks associated with the liquid staking provider Stride, which has undergone multiple audits and implemented IBC limits to minimize vulnerabilities. As a comparison, the ATOM accelerator program also liquid staked around 60k ATOM (~600k USD) by using Stride. **Additionally, Stride has partnered with Forge and committed to incentivize pools on Forge with their own governance tokens.** \n\nBy implementing this proposal, the Evmos community can expect improved utility and value from the treasury funds, increased market liquidity, and a more sustainable DAO and Forge DEX model. A LSD pool by the treasury, along with the security measures in place, will contribute to the overall growth and success of the Evmos ecosystem. \n\n## Stride\n\nThe Stride DAO will be providing incentives as soon as technically possible. If the community provides treasury liquidity of stEVMOS/EVMOS it allows stride to incentivize different pools (like stEVMOS/USDC) instead which brings more external TVL into the Evmos ecosystem.\n\n## Timeframe\n\nAfter careful consideration and discussion, the general agreement is to pool these funds into a liquidity pool for a period of 6 months. A follow up proposal will be made to renew after the specified period. If the renewal is rejected, the 2M Evmos will be returned. The requested funds only provision liquidity to Forge. \n\nSide note: If a vault provider that is trusted deploys on Evmos, it could be worth considering entrusting the management of the LP position to the vault.\n\n## About Forge\n\nThe Evmos DAO and OA teamed up and delivered a fully UniV3 compatible DEX on Evmos. Forge is fully community owned and funded. \n\nWhat we offer is: \n\n- No investment token\n- No initial protocol fees\n- Not profit oriented\n- UniV3 functionalities (concentrated liquidity)\n- Integrated IBC asset (coming soon)\n- One click liquid staking button (coming soon)\n\n[See full proposal here](https://www.mintscan.io/evmos/proposals/113)\n\n## Multisig 4/6\n\nThe position must be adjusted on a regular basis because stEVMOS accrues value against EVMOS daily. Therefore, it is important to keep the multisig simple and effective. \n\n- CO | Orbital Apes\n- 0xCtrlAltApe | Orbital Apes\n- Luisqa | Zenith Station\n- Silk Nodes\n- LPX | DAO\n- GV | DAO",
    "recipient": "evmos1fs7zw89zapquqpguqspqy8w6au7wveks0rdgwl",
    "amount": "2000000000000000000000000atevmos",
    "deposit": "100000000000000000atevmos"
}